Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/migrant_workers/employment_permits/overview_employment_permits.html.txt.tmx
Source language: en
Languages: ga

source: Overview of employment permits
ga: Forbhreathnú ar cheadanna fostaíochta

source: Most non-EEA nationals must have an employment permit to work in Ireland
ga: Caithfidh an chuid is mó de náisiúnaigh neamh-LEE cead fostaíochta a bheith acu chun oibriú in Éirinn

source: The employment permits scheme is governed by the Employment Permits Acts 2003–2014
ga: Rialaíonn na hAchtanna um Cheadanna Fostaíochta, 2003-2014 an scéim cheadanna fostaíochta

source: Since 1 October 2014, under the Employment Permits (Amendment) Act 2014 there are 9 types of employment permit
ga: Ón 1 Deireadh Fómhair 2014 ar aghaidh, faoin Acht um Cheadanna Fostaíochta (Leasú), 2014 tá 9 cineál de cheadanna fostaíochta ann

source: They include a General Employment Permit and a Critical Skills Employment Permit, which have replaced the work permit and Green Card permit respectively
ga: Ina measc tá Cead Fostaíochta Ginearálta agus Cead Fostaíochta Scileanna Ríthábhachtacha, a tháinig in ionad an cheada oibre agus chead an Chárta Ghlais, faoi seach

source: New types of employment permit include a Reactivation Employment Permit for those whose employment permit has expired in certain circumstances
ga: I measc na cineálacha nua de chead fostaíochta, tá Cead Fostaíochta Athghníomhachtaithe dóibh siúd ar éag a gcead fostaíochta faoi chúinsí áirithe

source: The Act also provides that a non-EEA national without an employment permit, who took all reasonable steps to get one, may be allowed to take civil action against the employer to compensate them for work done or services rendered
ga: Anuas air sin, forálann an tAcht, gur féidir le náisiúnach neamh-LEE nach bhfuil cead fostaíochta aige/aici, a rinne gach beart réasúnta chun ceann a fháil, dul i mbun caingean shibhialta i leith an fhostóra chun cúiteamh a fháil as aon obair a rinneadh nó aon seirbhísí a soláthraíodh

source: The 4 main types of employment permit are as follows:
ga: Is iad na 4 phríomhshaghas de chead fostaíochta:

source: General Employment Permits (formerly work permits) are available for occupations with an annual remuneration of €30,000 or more
ga: Tá Ceadanna Fostaíochta Ginearálta (ceadanna oibre roimhe seo) ar fáil do ghairmeacha ag a bhfuil luach saothair bliantúil €30,000 nó níos mó

source: They will only be considered in exceptional cases for jobs with a lower annual remuneration
ga: Ní dhéanfar breithniú orthu ach i gcásanna eisceachtúla do phoist ag a bhfuil luach saothair níos ísle

source: Normally, a labour market needs test is required
ga: De ghnáth, teastaíonn tástáil riachtanas an mhargaidh shaothair

source: Critical Skills Employment Permit
ga: Cead Fostaíochta Scileanna Ríthábhachtacha

source: Critical Skills Employment Permits (formerly Green Card permits) are available for most occupations with annual remuneration of over €60,000
ga: Tá Ceadanna Fostaíochta Scileanna Ríthábhachtacha (ceadanna an Chárta Ghlais roimhe seo) ar fáil do nach mór gach gairm ag a bhfuil luach saothair bliantúil os cionn €60,000

source: They are also available for occupations with annual remuneration of at least €30,000 on the Highly Skilled Occupations List
ga: Tá fáil orthu, chomh maith, do ghairmeacha ag a bhfuil luach saothair bliantúil €30,000, ar a laghad ar Liosta na nGairmeacha Ardoilte

source: There is no requirement for a labour market needs test
ga: Níl aon ghá le tástáil riachtanas an mhargaidh shaothair

source: Dependant/Partner/Spouse Employment Permits apply to spouses, recognised partners, civil partners and dependants of holders of Critical Skills Employment Permits or existing Green Card permits or researchers under a hosting agreement
ga: Baineann Ceadanna Fostaíochta Cleithiúnaí/Páirtnéara/Céile le céilí, páirtnéirí aitheanta, páirtnéirí sibhialta agus cleithiúnaithe de chuid sealbhóirí Ceadanna Fostaíochta Scileanna Ríthábhachtacha, ceadanna reatha an Chárta Ghlais nó taighdeoirí faoi chomhaontú óstála

source: Reactivation Employment Permits allow foreign nationals who entered the State on a valid employment permit but who fell out of the system through no fault of their own, or have been badly treated or exploited in the workplace, to work again
ga: Ceadaíonn Ceadanna Fostaíochta Athghníomhachtaithe do náisiúnaigh iasachta a d’iontráil an Stát ar chead fostaíochta bailí ach a d’fhág an córas gan iad féin a bheith mar chúis leis, nó ar caitheadh go dona leo nó ar baineadh leas astu san ionad oibre, chun oibriú arís

source: Applicants for a Reactivation Employment Permit must first apply for a temporary immigration permission stamp 1 to the Irish Naturalisation and Immigration Service (INIS)
ga: Ní mór d’iarratasóirí ar Chead Fostaíochta Athghníomhachtaithe iarratas a dhéanamh, i dtosach báire, ar stampa cead sealadach inimirce 1 ar Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: You can find the eligibility criteria, guidelines and application form on inis.gov.ie
ga: Féadfaidh tú na critéir incháilitheachta, treoirlínte agus foirm iarratais a aimsiú ar inis.gov.ie

source: Other types of employment permit
ga: Cineálacha eile de chead fostaíochta

source: There are 5 other types of employment permit, as follows:
ga: Tá 5 cineál eile de chead fostaíochta ann:

source: • Contract for Services Employment Permits are for foreign undertakings with a contract to provide services to an Irish entity
ga: • Baineann Ceadanna Fostaíochta Conradh Seirbhísí le fiontair iasachta ag a bhfuil conradh chun seirbhísí a sholáthar d’aonán Éireannach

source: These permits allow the transfer of non-EEA employees to work on the Irish contract in Ireland while remaining on an employment contract outside the State
ga: Ceadaíonn na ceadanna seo fostaithe neamh-LEE a aistriú chun oibriú ar chonradh Éireannach in Éirinn fad a fhanann siad ar chonradh fostaíochta lasmuigh den Stát

source: Generally, a labour market needs test is required
ga: Go ginearálta, níl tástáil riachtanas an mhargaidh shaothair ag teastáil

source: • Intra-Company Transfer Employment Permits allow senior management, key personnel and trainees working in an overseas branch of a multi-national company to transfer to the Irish branch
ga: • Ceadaíonn Ceadanna Fostaíochta Aistrithe Ionchuideachta don bhainistíocht shinsearach, an príomhphearsanra agus oiliúnaithe a oibríonn i mbrainse de chuideachta ilnáisiúnta thar sáile chun aistriú chuig brainse na hÉireann

source: They must be earning at least €40,000 a year (trainees must be earning at least €30,000 a year) and have been working for the company for a minimum of 6 months (one month if a trainee)
ga: Ní mór go mbíonn €40,000, ar a laghad, sa bhliain á thuilleamh acu (ní mór go mbíonn €30,000, ar a laghad, sa bhliain á thuilleamh ag oiliúnaithe) agus go bhfuil siad ag oibriú don chuideachta ar feadh 6 mhí, ar a laghad (mí amháin le haghaidh oiliúnaí)

source: • Internship Employment Permits are available to non-EEA national full-time students who are enrolled in a third-level institution outside Ireland and have a work experience job offer in the State
ga: • Tá Ceadanna Fostaíochta Intéirneachta ar fáil do mhic léinn lánaimseartha náisiúnacha neamh-LEE atá cláraithe in institiúid tríú leibhéal lasmuigh d’Éirinn agus a bhfuil tairiscint poist taithí oibre acu sa Stát

source: • Sport and Cultural Employment Permits are available for employment in the State for the development, operation and capacity of sporting and cultural activities
ga: • Tá Ceadanna Fostaíochta Spóirt agus Cultúrtha ar fáil le haghaidh fostaíochta sa Stát ar mhaithe le forbairt, oibriú agus cumas gníomhaíochtaí spóirt agus cultúrtha

source: • Exchange Agreement Employment Permits apply to those employed in the State under prescribed agreements, for example, the Fulbright Program for researchers and academics
ga: • Baineann Ceadanna Fostaíochta Comhaontú Malartaithe leo siúd atá fostaithe sa Stát faoi chomhaontuithe ordaithe, mar shampla, Clár Fulbright le haghaidh taighdeoirí agus an lucht léinn
